  Выбираем архив: 
  <form enctype="multipart/form-data" action="" method="POST">
  <input name="userfile" type="file" /><br />
  <br />
    <select name="date">
	<option value="may">Май</option>
	<option value="june">Июнь</option>
	</select>
	<br /><br />
  <input type="submit" name="load" value="Загрузить xls" />
  </form>

<?php
include("parser.php");

if(@$_POST["date"]){

  $uploaddir= '/var/www/html/roslesinforg/web/parser/tmp/';

  $loc = $uploaddir . $_FILES['userfile']['name'];

  move_uploaded_file($_FILES['userfile']['tmp_name'], $loc);

  /*************/

// Массив с названиями филиалов и их ID
$branches = [1 => 'Архангельск', 2 => 'Дальлес', 3 => 'Заплес', 4 => 'Запсиблес', 5 => 'Карел', 6 => 'Мослес', 7 => 'Поволжский', 8 => 'Севзап', 9 => 'Севлес', 10 => 'Центрлес', 11 => 'Воронеж', 12 => 'Востсиб', 13 => 'Прибайкал', 14 => 'Северо-Кавказский', 15 => 'Приморский', 16 => 'Камчатский', 17 => 'Амурский', 18 => 'Омский', 19 => 'Томский', 20 => 'Тюменский', 21 => 'Уральский', 22 => 'Ханты', 23 => 'Башкирский', 24 => 'Казанский', 25 => 'Пензенский', 26 => 'Пермский', 27 => 'Ульяновский', 28 => 'Вятский', 29 => 'Коми', 30 => 'Тверской', 31 => 'Рязанский', 32 => 'Марий Эл', 33 => 'Тамбовский', 34 => 'Южный', 35 => 'Читинский', 36 => 'Якутский', 37 => 'Бурятский'];

$subjects = [1 => "Республика Башкортостан", 2 => "Республика Бурятия", 3 => "Республика Дагестан", 4 => "Кабардино-Балкарская Республика", 5 => "Республика Калмыкия", 6 => "Республика Карелия", 7 => "Республика Коми", 8 => "Республика Марий Эл", 9 => "Республика Мордовия", 10 =>  "Республика Северная Осетия - Алания", 11 =>  "Татарстан", 12 => "Республика Тыва", 13 =>  "Удмуртская Республика", 14 =>  "Республика Ингушетия", 15 => "Чувашская Республика - Чувашия", 16 => "Республика Саха (Якутия)", 17 => "Алтайский край", 18 => "Краснодарский край", 19 => "Красноярский край", 20 =>  "Приморский край", 21 =>  "Ставропольский край", 22 =>  "Хабаровский край", 23 => "Амурская область", 24 => "Архангельская область", 25 =>  "Астраханская область", 26 => "Белгородская область", 27 => "Брянская область", 28 => "Владимирская область", 29 => "Волгоградская область", 30 =>  "Вологодская область", 31 =>  "Воронежская область", 32 =>  "Нижегородская область", 33 =>  "Ивановская область", 34 => "Иркутская область", 35 =>  "Калининградская область", 36 =>  "Тверская область", 37 => "Калужская область", 38 =>  "Камчатский край", 39 =>  "Кемеровская область", 40 =>  "Кировская область", 41 =>  "Костромская область", 42 =>  "Самарская область", 43 =>  "Курганская область", 44 => "Курская область", 45 =>  "Ленинградская область", 46 =>  "Липецкая область", 47 => "Магаданская область", 48 =>  "Московская область", 49 => "Мурманская область", 50 => "Новгородская область", 51 => "Новосибирская область", 52 =>  "Омская область", 53 => "Оренбургская область", 54 => "Орловская область", 55 =>  "Пензенская область", 56 => "Пермский край", 57 =>  "Псковская область", 58 =>  "Ростовская область", 59 => "Рязанская область", 60 =>  "Саратовская область", 61 =>  "Сахалинская область", 62 =>  "Свердловская область", 63 => "Смоленская область", 64 => "Тамбовская область", 65 => "Томская область", 66 =>  "Тульская область", 67 => "Тюменская область", 68 =>  "Ульяновская область", 69 =>  "Челябинская область", 71 =>  "Ярославская область", 72 =>  "г. Санкт-Петербург", 73 => "г. Москва", 76 =>  "Республика Адыгея (Адыгея)", 77 => "Республика Алтай", 78 => "Еврейская автономная область", 79 => "Карачаево-Черкесская Республика", 80 =>  "Республика Хакасия", 84 => "Ненецкий автономный округ", 87 =>  "Ханты-Мансийский автономный округ - Югра", 88 => "Чукотский автономный округ", 90 => "Ямало-Ненецкий автономный округ", 91 =>  "Забайкальский край", 94 => "Чеченская Республика", 95 => "Республика Крым", 96 =>  "г. Севастополь"];


  $xls = SimpleXLS::parse($loc);

$sheet = $xls->rows(1);

$count = 0;
  foreach ( $xls->rows() as $r => $row ) {
    
    if( $row[0] && $row[0] != 'Организация' && $row[11] && $row[12] ) {

      if( $row[5] ) {
        echo "Это контрагент: ";
        
        foreach ( $row as $c => $cell ) {
          echo ($c > 0) ? ', ' : '';
          echo ( $r === 0 ) ? '<b>'.$cell.'</b>' : $cell;
        }


        foreach ($subjects as $key => $value) {
          if( strpos($row[7], $value) !== false ) {
            $subject = $key;
            break;
          }
        }

        if (!$row[7]) echo "субъект не указан";
        elseif ($subject) echo "Cубъект : " . $subject;// ." - ". $row[7];
        else echo $row[7];
        
        echo '<br/>';
      }

      elseif (strpos($row[0], 'Рослесинфорг')) {
        // echo "<br><b>Это филиал</b><br>";
        // foreach ( $row as $c => $cell ) {
        //   echo ($c > 0) ? ', ' : '';
        //   echo ( $r === 0 ) ? '<b>'.$cell.'</b>' : $cell;
        // }
        

        foreach ($branches as $key => $value) {
          if( strpos($row[0], $value) !== false ) {
            $branch = $key;
            break;
          }
        }

        if($branch) echo "<br><br><b>Филиал опознан: </b>" . $branch ." - ". $row[0];
        else echo $row[0];

        echo '<br/>';
        // $count++;
      }
      else {
        echo "<br><b><i>Это работы: </i></b>";
        
        // foreach ( $row as $c => $cell ) {
        //   echo ($c > 0) ? ', ' : '';
        //   echo ( $r === 0 ) ? '<b>'.$cell.'</b>' : $cell;
        // }

        echo $row[0];
        echo '<br/>';

        // echo '<pre>';
        // print_r( $row );
        // echo '</pre>';
      }
    }

    // foreach ( $row as $c => $cell ) {
    //   echo ($c > 0) ? ', ' : '';
    //   echo ( $r === 0 ) ? '<b>'.$cell.'</b>' : $cell;
    // }


    // echo '<br/>';
  }

echo '<br/>Всего филиалов: '.$count.'<br/><br/>';



  echo 'QQQ<pre>';
  print_r( $xls->rows() );
  echo '</pre>';
  /*************/

  // echo '<pre>';
  // // var_dump($loc);
  // if ( $xls = SimpleXLS::parse($loc)) {
  //   print_r( $xls->rows() ); // Сливаем в массив первый лист книжки эксцеля
  // } else {
  // 	echo SimpleXLSX::parseError();
  // }
  // echo '</pre>';

}

?>