modules/pd/views/pd-work-process/_form.php

use kartik\date\DatePicker;
use kartik\file\FileInput;
$id = Yii::$app->request->get('pd_work');
$pdwork = PdWork::find()->where(['=' , 'id', "$id"] )->one();
---
SELECT * FROM `pd_work` WHERE `id` = '1482'


    <?= $form->field($model, 'pd_object')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'pd_step')->dropDownList(ArrayHelper::map(app\modules\pd\models\PdStep::find()->orderBy(['sort_order' => SORT_ASC])->all(), 'id', 'step_name')) ?>
---
SELECT * FROM `pd_step` ORDER BY `sort_order`