<?php

use yii\helpers\Html;

$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">

      <div class="row">
            <div class="col-lg-4">
                <h2>Задача проекта №1</h2>

                <p>Формирование единой и централизованной производственной базы данных потенциальных заказчиков из числа лесопользователей, 
				для которых филиалами ФГБУ «Рослесинфорг» ранее были разработаны проекты освоения лесов, а также осуществление взаимодействия 
				с арендаторами лесных участков, контактные данные которых находятся в открытом доступе.</p>

            </div>
            <div class="col-lg-4">
                <h2>Разработка</h2>

                <p>Проект разрабатывается на принципиально новой базе и платформе которая базируется на объектно-ориентированной модели фреймворка YII2. 
				Для созданиия проекта использованы технологии <strong>MYSQL/PHP/JSON/JS/HTML/CSS/BOOTSTRAP</strong>, что дает непревзойденную гибкость в разработке и 
				достижении поставленных задач. Производственная база данных призвана быть общедоступной как для центрального аппарата так и для всех
				филиалов ФГБУ "Рослесинфорг".</p>

            </div>
            <div class="col-lg-4">
			<h2>Задача проекта №2</h2>

                <p>Осуществление контроля по взаимодействию с лесопользователями, действие проектной документации которых истекает, 
				с целью своевременного заключения нового договора на выполнение соответствующих работ, прописанных в контракте.</p>

            </div>
        </div>

</div>
