<?php

use yii\helpers\Html;


$this->title = 'Техническая поддержка системы «Лесной кластер»';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="forest-work-index" style="padding: 0 5%;">

<div style="text-align: center; border-bottom: 1px solid #ccc; padding: .5rem;">Единая централизованная информационная система «Лесной кластер»</div>
<h1 style="text-align: center; color: #58c">Служба технической поддержки</h1>
<!-- <div style="text-align: center; font-size: 1.5rem; color: #888;">по предоставлению отчета о работах по разработке ПОЛ</div> -->

<br><br>
<p>Система «Лесной кластер» находится в непрерывной разработке. По мере готовности вводится новый функционал и расширяются существующие возможности. В связи с этим иногда могут возникать ситуации, приводящие к ошибкам в работе некоторых модулей.</p>
<p>В случае обнаружения ошибок при работе с системой просим вас уведомлять о них службу технической поддержки. Для этого отправьте электронное письмо по адресу <strong><a href="mailto:ladin.eg@roslesinforg.ru">ladin.eg@roslesinforg.ru</a></strong>, в котором кратко опишите проблему и при необходимости приложите копию экрана с ошибкой (скриншот). Это поможет нам быстрее понять причины возникновения внештатной ситуации. Со своей стороны мы постараемся максимально быстро привести систему в рабочее состояние.</p>
<br>
<p>Заранее спасибо за ваше понимание и конструктивный подход.</p>

</div>