modules/pd/views/pd-work/_form.php

    <?= $form->field($model, 'warning_descr')->textarea(['rows' => 6, 'cols' => 20]) ?>
</div>

    <?= $form->field($model, 'branch')->dropDownList(ArrayHelper::map(app\modules\pd\models\Branch::find()->where($condBranch)->orderBy(['name' => SORT_ASC])->all(), 'branch_id', 'name')) ?>
---
SELECT * FROM `branch` WHERE branch_id = 4 ORDER BY `name`

    <?= $form->field($model, 'customer')->textInput(['maxlength' => true]) ?>

    <?php //= $form->field($model, 'basedoc_type')->textInput() ?>
    <?= $form->field($model, 'basedoc_type')->dropDownList(ArrayHelper::map(app\modules\pd\models\BasedocType::find()->all(), 'id', 'doctype')) ?>
---
SELECT * FROM `basedoc_type`

            ]);
    ?>

    <?= $form->field($model, 'work_name')->dropDownList(ArrayHelper::map(app\modules\pd\models\PdworkType::find()->all(), 'id', 'work_name')) ?>
---
SELECT * FROM `pd_worktype`

    <?= $form->field($model, 'in_complex')->checkbox(['id' => 'in_complex']) ?>

    <?php //= $form->field($model, 'federal_subject')->textInput() ?>
    <?= $form->field($model, 'federal_subject')->dropDownList(ArrayHelper::map(app\modules\pd\models\ResponsibilityArea::find()->joinWith('federalSubject')->where($condBranch)->orderBy(['federal_subject.name' => SORT_ASC])->all(), 'federal_subject_id', 'federalSubject.name')) ?>
---
SELECT `responsibility_area`.* FROM `responsibility_area` LEFT JOIN `federal_subject` ON `responsibility_area`.`federal_subject_id` = `federal_subject`.`federal_subject_id` WHERE branch_id = 4 ORDER BY `federal_subject`.`name`


    <?= $form->field($model, 'work_area')->textInput() ?>

    <?= $form->field($model, 'forest_usage')->dropDownList(ArrayHelper::map(app\modules\pd\models\ForestUsage::find()->all(), 'id', 'usage_name')) ?>


    <?= $form->field($model, 'work_reason')->dropDownList(ArrayHelper::map(\app\modules\pd\models\PdWorkReason::find()->all(), 'id', 'reason')) ?>
---
SELECT * FROM `forest_usage`
SELECT * FROM `pd_work_reason`