modules/pd/views/pd-work/index.php


    $form = ActiveForm::begin(); // ['options' => ['class' => 'form-inline']]

    echo $form->field($branchEmul_model, 'branchEmul')->dropDownList(ArrayHelper::map(app\modules\pd\models\Branch::find()->orderBy(['name' => SORT_ASC])->all(), 'branch_id', 'name'));
---
SELECT * FROM `branch` ORDER BY `name`


            [
                'attribute' => 'pdWorkName',
                'filter' => ArrayHelper::map(app\modules\pd\models\PdWorktype::find()->asArray()->orderBy(['id' => SORT_ASC])->all(), 'work_name', 'work_name'),
---
SELECT * FROM `pd_worktype` ORDER BY `id`

                        $return =  $model->pdWorkName;

                    if ( !($model->work_name == 1 or $model->work_name == 2 ) and $model->forest_usage){
                        $usage_forest = \app\modules\pd\models\ForestUsage::find()->where(['=','id',$model->forest_usage])->select(['articles'])->asArray()->one();
---
SELECT `articles` FROM `forest_usage` WHERE `id` = 8

                    $one_forestry = '';
                    if ($model->forestry){
                        $list_forestry =explode(" ", trim($model->forestry));
                        $findforestry = \app\modules\lu\models\Forestry::find()
                            ->where(['=','subject_kod',$model->federal_subject])
                            ->andWhere(['forestry_kod'=>$list_forestry])
                            ->select(['forestry_name'])
                            ->asArray()->all();
---
SELECT `forestry_name` FROM `forestry` WHERE (`subject_kod` = 48) AND (`forestry_kod`='10')


            [
                'attribute' => 'federalSubjectName',
                'filter' => ArrayHelper::map(app\modules\pd\models\FederalSubject::find()->asArray()->orderBy(['name' => SORT_ASC])->all(), 'name', 'name'),
---
SELECT * FROM `federal_subject` ORDER BY `name`

            [
                'attribute' => 'branchName',
                'label' => 'Филиал',
                'filter' => ArrayHelper::map(app\modules\pd\models\Branch::find()->asArray()->orderBy(['name' => SORT_ASC])->all(), 'name', 'name'),
---
SELECT * FROM `branch` ORDER BY `name`