modules/pd/controllers/PdWorkController.php

SELECT `work_name` AS `work_type`, SUM(IF(forestry_quantity = 0 or forestry_quantity is NULL, 1, forestry_quantity)) AS `forestry_qnty`, COUNT(*) AS `row_qnty` FROM `pd_work` WHERE (pd_work.branch = 6) AND (completed = 0) GROUP BY `work_name`
---
            // SELECT work_name, SUM(IF(forestry_quantity = 0 or forestry_quantity is NULL, 1, forestry_quantity)) forestry_quantity, COUNT(id) row_quantity FROM pd_work GROUP BY work_name

            // Количество документов в работе:
            $pdwork_active = PdWork::find()
                ->select(['work_type' =>'work_name', 'forestry_qnty' => 'SUM(IF(forestry_quantity = 0 or forestry_quantity is NULL, 1, forestry_quantity))', 'row_qnty' => 'COUNT(*)' ])
                ->groupBy('work_name')
                ->where($condBranch)
                ->andWhere("completed = 0")
                ->all();

SELECT `person_kod`, `branch_kod` FROM `ca_curator`
SELECT `id`, `fio` FROM `user` WHERE `id` IN ('15', '131', '79')
---
    public function actionUpdate($id)
    {
        //$id_curators берем колонку 'person_kod' из масива и удаляем повторы
        $curators_branch = CaCurator::find()->select(['person_kod', 'branch_kod'])->asArray()->all();
        $id_curators = array_column($curators_branch, 'person_kod');
        $id_curators = array_unique($id_curators);
        $users_name = User::find()->select(['id','fio'])->asArray()->where(['in', 'id', $id_curators])->all();

SELECT * FROM `pd_work` WHERE `id`='531'
---
    protected function findModel($id)
    {
        if (($model = PdWork::findOne($id)) !== null) {