modules/pd/controllers/PdWorkProcessController.php

SELECT * FROM `pd_work` WHERE `id`='1482'
SELECT * FROM `pd_worktype` WHERE `id`=4
SELECT * FROM `branch` WHERE `branch_id`=6
SELECT * FROM `basedoc_type` WHERE `id`=2
---
            $model->person_responsible = Yii::$app->user->identity->id;

            // Данные для размещения в заголовке страницы - какой ПД принадлежит стадия
            $pdwork = PdWork::find()->where(['id'=>$pdwork_id])->one();
            $pdwork->pdworktype = PdWorkType::find()->where(['id' => $pdwork->work_name])->one();
            $pdwork->branchname = Branch::find()->where(['branch_id' => $pdwork->branch])->one();
            $pdwork->docName = BasedocType::find()->where(['id' => $pdwork->basedoc_type])->one();